// 1) Запитати змінну у користувача. Якщо змінна дорівнює числу 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
console.log(
  "1) Запитати змінну у користувача. Якщо змінна дорівнює числу 10, виведіть 'Вірно', інакше виведіть 'Невірно'."
);
let a = +prompt("Число");
if (a === 10) {
  console.log("Вірно");
} else {
  console.log("Невірно");
}
// 2) Напишіть дві перевірки.
// Якщо змінна test дорівнює true, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Якщо змінна test не дорівнює true, то виведіть 'Вірно', інакше виведіть 'Невірно'
// Перевірте роботу скрипта при test, що дорівнює true, false.
let b = "test";
if (b == true) {
  console.log("Вірно");
} else {
  console.log("Невірно");
}

if (b !== true) {
  console.log("Вірно");
} else {
  console.log("Невірно");
}

// 3) Обчислити суму покупки з урахуванням знижки. Знижка 3% надається, якщо сума покупки більша за 500 грн., а знижка 5% - якщо сума покупки більша за 800 грн. Суму покупки вводить користувач.
let c = +prompt("До сплати ");
if (c > 500 && c < 800) {
  c *= 0.3;
  console.log("Знижка: " + a.toFixed());
} else if (c >= 800) {
  c *= 0.5;
  console.log("Знижка: " + a.toFixed());
} else {
  console.log("Недостатня сумма");
}

// 1) Виведення чисел від 25 до 0 (порядок зменшення).
console.log("1) Виведення чисел від 25 до 0 (порядок зменшення).");
let i = 26;

while ((i > 0, i--)) {
  console.log(i);
}

// 2) Виведення чисел від 10 до 50, які кратні 5.
console.log("2) Виведення чисел від 10 до 50, які кратні 5.");
let x = 10;

while (x <= 50) {
  if (x % 5 == 0) {
    console.log(x);
  }

  ++x;
}

// 3) *Знайти суму чисел в межах від 1 до 100.
console.log("3) *Знайти суму чисел в межах від 1 до 100.");
let y = 0;
let u = 0;
while (y < 100) {
  y++;
  u += y;
}
console.log(u);
